# Read and write CSV and XLS files

In [23]:
import pandas as pd

In [3]:
#INSTALL: pip3 install xlrd

#read excel file

In [4]:
#write DF to csv

In [5]:
# INSTALL: pip3 install openpyxl

#write DF to Excel

# GROUP-BY

In [20]:
# import weather_data_cities
 #weather by cities

In [19]:
#perform group by city

In [18]:
#print groups

In [17]:
#or to get specific group

In [16]:
#Find maximum temperature in each of the cities

In [15]:
#averge of temperature and windspeed for groups

In [22]:
#describe groups

# concatenate Data Frames

In [25]:
import pandas as pd
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})

india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [24]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [27]:
#concate two dataframes- append

In [28]:
#if you want continuous index

In [29]:
#concatenate vertically

# Merge DataFrames

In [30]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore", 'hyderabad'],
    "temperature": [32,45,30,40]})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2   banglore           30
3  hyderabad           40

In [31]:
humidity_df = pd.DataFrame({
    "city": ["delhi","mumbai","banglore"],
    "humidity": [68, 65, 75]})
humidity_df

       city  humidity
0     delhi        68
1    mumbai        65
2  banglore        75

In [33]:
#merge two dataframes with out explicitly mention index

In [34]:
#OUTER-JOIN

# Numerical Indexing (.loc vs iloc)

In [35]:
import pandas as pd
import numpy as np

In [36]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,19], index=[49,48,47,46,45, 1, 2, 3, 4, 5])
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   19

In [38]:
df.loc[:2]

    0
49  1
48  2
47  3
46  4
45  5
1   6
2   7

In [39]:
df.iloc[:2]

    0
49  1
48  2

In [40]:
df.loc[45]

0    5
Name: 45, dtype: int64